//EAD625VS JOB CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 REPRO IFILE(DD1) OFILE(DD2)
//DD1      DD DSN=GR.EAD625.ARC.DATA,DISP=SHR
//DD2      DD DSN=GR.EAD625.ARC.VS.VS001,DISP=SHR