//EAD625XX JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//         JCLLIB  ORDER=GR.GERAL.PROCLIB
//COMPDB2B EXEC DFHCODB2,NAME='EAD625XX',INSTR='EAD625'
//LKED.SYSIN DD *
  NAME EAD625XX(R)
/*
//BIND.SYSTSIN DD *
DSN SYSTEM(DB8G)
BIND PLAN(EAD625XX) MEM(EAD625XX) ACT(REP) ISOLATION(CS) -
     LIB('DSN810.DBRMLIB.DATA')
END
/*