//COMPCOB1 JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC IGYWCG
//SYSIN    DD DSN=GR.EAD625.JOBLIB(PROGCOB1),DISP=SHR
//SYSPRINT DD SYSOUT=*