//COMPCOB3 JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//         JCLLIB  ORDER=GR.EAD625.PROCLIB
//COBCOMP  EXEC DFHCOBLB,LIB1=GR.EAD625,NOME='PROGCOB3',LIB2=GR.GERAL
//LKED.SYSIN DD *
  NAME PROGCOB3(R)