//EXECCOB  JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//JOBLIB   DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//STEP1    EXEC PGM=PROGCOB3
//STEP2    EXEC PGM=PROGCOB4,COND=(100,NE,STEP1)