//EXECABEN JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//JOBLIB   DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//*
//STEP1    EXEC PGM=PROGCOB3
//*STEP1    EXEC PGM=PROGCOB2
//*
//STEPIF   IF STEP1.ABEND = TRUE THEN
//*STEPIF   IF STEP1.ABENDCC = S0CB THEN
//STEP2    EXEC PGM=PROGCOB4
//STEPIF   ENDIF