//EXECPROC JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//         JCLLIB ORDER=GR.EAD625.PROCLIB
//STEP1    EXEC PROCBASE,ARQUIVO='GR.EAD625.PROCLIB.ARQ1'