//ICEGENER JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=ICEGENER
//SYSPRINT DD SYSOUT=*
//SYSUT2   DD DSN=GR.EAD625.JOBLIB.SORTIN,
//         SPACE=(TRK,(1,1),RLSE),
//         DCB=(RECFM=FB,LRECL=30,DSORG=PS,BLKSIZE=0),
//         DISP=(MOD,CATLG,DELETE)
//SYSUT1   DD *
034MARCELO SILVA
003LUCCA RAPHAEL
032DAYANA CRISTINA
063NISAURO JOSE
058QUITERIA MARIA