//IEFBR14A JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//JOB62502 DD DSN=GR.EAD625.JOBLIB.JOB62502,
//         SPACE=(TRK,(1,1),RLSE),
//         DCB=(RECFM=FB,LRECL=80,DSORG=PS,BLKSIZE=0),
//         DISP=(MOD,CATLG,DELETE)