//IEFBR14B JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IEFBR14
//JOB62503 DD DSN=GR.EAD625.PROCLIB,
//         SPACE=(TRK,(1,1,10),RLSE),
//         DCB=(RECFM=FB,LRECL=80,DSORG=PO,BLKSIZE=0),
//         DISP=(NEW,CATLG,DELETE)