//IKJEFT01 JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
LISTDS 'GR.EAD625.M2.COBOL.DB2' MEMBER