//SORT     JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//SORTIN   DD DSN=GR.EAD625.JOBLIB.SORTIN,DISP=SHR
//SORTOUT  DD DSN=GR.EAD625.JOBLIB.SORTIN,DISP=SHR
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 SORT FIELDS=(1,3,CH,D)