//SORTTEMP JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=SORT
//SORTIN   DD DSN=GR.EAD625.JOBLIB.SORTIN1,DISP=SHR
//         DD DSN=GR.EAD625.JOBLIB.SORTIN2,DISP=SHR
//SORTOUT  DD DSN=&&TEMP
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 OPTION COPY
//*