//EAD625XX JOB 'COMP COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//         JCLLIB  ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBLB,LIB1=GR.EAD625,NOME='EAD625XX',LIB2=GR.GERAL
//LKED.SYSIN DD *
  NAME EAD625XX(R)