//EAD62502  JOB 'EX COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID              00010000
//**********************************************************************00010103
//* EXECUTE PROGRAM EAD62502                                           *00011003
//**********************************************************************00012003
//STEP001  EXEC PGM=EAD62502
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSIN    DD *
MARCELO SILVA
//SYSOUT   DD SYSOUT=*