//COBCICS  JOB 'EAD625',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//         JCLLIB  ORDER=GR.GERAL.PROCLIB
//EAD625CM EXEC DFHCICS1,NAME='EAD625CM',INSTR='EAD625',LIB2='GR.GERAL'