//PROCBASE PROC
//STEP1    EXEC PGM=IEFBR14
//JOB62503 DD DSN=&ARQUIVO,
//         SPACE=(TRK,(1,1),RLSE),
//         DCB=(RECFM=FB,LRECL=80,DSORG=PS,BLKSIZE=0),
//         DISP=(NEW,CATLG,DELETE)
//         PEND